<template>
    <div class="clear">
        <div class="modelWrap">
			<div class="wrap"></div>
			<div class="box">
				<div class="modelHeader">
					<h3>服务协议</h3>
					<span @click="close()">x</span>
				</div>
				<div class="modelBody">
					<p class="textList">在您使用我司服务前，您已认真、仔细阅读并充分理解本《服务协议》（“本协议”）的所有条款、内容。在您按照我司的流程成功进入我司页面后，注册或使用本协议下任何服务，即视为对本服务协议的充分理解和完全接受，本协议即产生法律效力。您有权依据本协议的条款享受我司的服务，同时有义务接受本协议条款的约束。</p>
					<p>1.用户资格</p>
					<p class="textList">您必须是中华人民共和国（以下简称“中国”，为避免疑义，仅为本协议之目的，不包括中国香港、澳门及台湾地区）具备完全民事行为能力的自然人或单位法人。无民事行为能力人、限制民事行为能力人不应当成为我司用户。</p>
					<p>2.我司的服务内容</p>
					<p class="textList">我司通过网络以及其他渠道和方式向您提供金融等服务。我司向您提供服务的具体内容由我司与您另行签署的其他协议约定。对于我司向您提供的服务是否收取服务费及服务费的具体标准和规则将由我司与您另行签署的其他协议及我司不时公开公布的规则确定。</p>
					<p>3.用户使用限制</p>
					<p class="textList">您不得利用我司服务从事任何不符合中国法律法规或侵犯他人权益的活动。我司在发现您从事该等活动时，有权不经通知而停止您对我司的全部或部分功能的使用。</p>
					<p>4.用户信息的提供、搜集及核实</p>
					<p class="textList">4.1您有义务在我司平台中填写自己的真实资料，并保证如店铺名称、经营信息、联系电话、联系地址等内容的有效性、安全性、真实性、合法性和及时更新，以便我司为您提供服务并与您进行及时有效的联系。您应完全独自承担因通过这些联系方式无法与您取得联系而导致您在使用本服务过程中遭受的任何损失或增加任何费用等不利后果。</p>
					<p class="textList">4.2为方便我司及我司的关联公司向您提供金融服务，您不可撤销地授权并同意我司及我司的关联公司获取您店铺的全部经营数据，并向相关机构或单位（包括但不限于中国人民银行金融信用信息基础数据库以及经国务院或其他政府有权部门批准合法设立的信息库、公安部门、公积金部门、社保部门、税务部门、民政部门、物流部门、通信运营商、电子商务平台、互联网社交平台等第三方机构）查询或确认与您相关的个人征信信息、财产信息、联络方式、关系人、资信状况、就业情况、居住地址、位置数据、通信行为、通讯信息、互联网使用信息、互联网使用行为等并保留相关核查资料等。</p>
					<p>5.用户信息的使用和披露</p>
					<p class="textList">5.1为限制在互联网上的欺诈、非法行为或其他刑事犯罪活动，，您同意我司可通过人工或自动程序对您的个人资料进行评价。</p>
					<p class="textList">5.2您认可并同意我司利用您的资料与您联络并（在某些情况下）向您传递针对您的情况而提供的信息，例如：有针对性的广告条、产品提供以及其他相关信息。您接受本协议即视为您同意收取这些资料。</p>
					<p class="textList">5.3我司对于您提供的、自行收集到的、经认证的个人信息、企业信息将按照本协议及有关规则予以保护、使用或者披露。我司将采用行业标准惯例以保护您的资料，但鉴于技术限制，我司不能确保您的全部私人通讯及其他资料不会通过本协议中未列明的途径泄露出去。</p>
					<p class="textList">5.4您授权我司及我司的关联公司，将您提供给我司的信息、享受我司服务产生的信息（包括本协议签署之前提供和产生的信息）以及我司根据本条约定查询、收集的信息，用于我司及我司的关联公司为您提供服务、推荐产品、开展市场调查与信息数据分析。您授权我司，除法律另有规定之外，基于为您提供更优质服务和产品的目的，向我司因服务必要开展合作的伙伴提供、查询、收集您的信息。我司将采取各种合法措施来确保您的个人信息安全，您认可并同意，非因我司故意行为所造成的此类事件损失，我司不承担任何违约或赔偿责任。本条款自本协议签署时生效，具有独立法律效力，不受合同成立与否及效力状态变化的影响。</p>
					<p class="textList">5.5我司有义务根据有关法律要求向司法机关和政府部门提供您的资料。</p>
					<p>6.知识产权</p>
					<p class="textList">我司的所有内容，包括但不限于文本、数据、图片、视频、源代码和其他所有信息，均由我司享有知识产权。未经我司事先书面同意，您或其他任何人不得复制、改编、传播、公布、展示或以任何其他方式侵犯我司的知识产权。</p>
					<p>7.免责条款</p>
					<p class="textList">如因不可抗力事件（包括但不限于因我司及相关第三方的设备、系统故障或缺陷、病毒、黑客攻击、网络故障、网络中断、地震、台风、水灾、海啸、雷电、火灾、瘟疫、流行病、战争、恐怖主义、敌对行为、暴动、罢工、交通中断、停止供应主要服务、电力中断、经济形势严重恶化、政府管制或其他类似事件），其他类似致使我司未能履行本协议或履行本协议不符合约定，不构成我司的违约，对于因此导致的损失，我司将不承担任何责任。</p>
					<p>8.通知</p>
					<p class="textList">本协议项下的通知如以公示方式作出，一经在我司公示即视为已经送达。除此之外，其他向您发布的具有专属性的通知将由我司向您在我司平台填写的手机发送，一经发送即视为已经送达。请您密切关注您手机中的信息。</p>
					<p>9.违约责任</p>
					<p class="textList">如果您违反了您在本协议中所作的陈述、保证、承诺或任何其他义务，致使我司或我司的股东、实际控制人、员工、其他用户承受任何损失，您应向受损失一方做出全额赔偿。</p>
					<p>10.终止</p>
					<p class="textList">除非我司终止本协议或者您申请终止本协议且经我司同意，否则本协议始终有效。在您违反了本协议规则或我司遇到本协议第7条约定的免责事项时，我司有权在不通知您的情况下载任何时间终止本协议或者限制您使用我司服务。</p>
					<p>11.适用法律和管辖</p>
                    <p class="textList">本协议适用中华人民共和国法律法规。本合同项下与之有关的一切争议，应协商解决；协商不成的，双方同意提交杭州仲裁委申请仲裁。仲裁裁决是终局的，对双方均有约束力。</p>
					<p>12.条款的独立性</p>
					<p class="textList">若本协议的部分条款被认定为无效或者无法实施时，本协议的其他条款仍然有效。</p>
					<p>13.其他</p>
					<p class="textList">13.1我司有权将本合同项下的权利义务全部或部分转让给第三方，对此您予以认可并同意。</p>
					<p class="textList">13.2我司在法律许可的范围内对本协议享有最终的解释权。</p>
				</div>
				<div class="modelFooter">
					<button @click="close()">关闭</button>
				</div>
					
			</div>
		</div>
    </div>
</template>
<script>

export default {
    data(){
        return{
			isShow:false,
        }
	},
    methods:{
        close(){
           this.$emit( "isShow",false) ;
        },
        init(){
			
		},
    },
    created(){
        this.init() ;
    }
}
</script>
<style lang="scss" scoped type="text/css">
   .modelWrap {
    .wrap {
        position: fixed;
        left: 0;
        right: 0;
        top: 0;
        bottom: 0;
        background: #000000;
        z-index: 11111;
        opacity: 0.7;
    }
    .box {
        position: absolute;
        top: 100px;
        left: 5%;
        padding: 0 2.5%;
        width: 85%;
        border-radius: 5PX;
        opacity: 1;
        z-index: 99999;
        background: #ffffff;
        margin-bottom: 100px;
        .modelHeader {
			position: relative;
            text-align: center;
            padding: 12PX 24PX;
            border-bottom: 2PX solid #e5e5e5;
            span {
				position: absolute ;
				right:10PX;
				top:12PX ;
				width: 20PX ;
				height: 20PX ;
				line-height: 20PX;
                font-size: 20PX;
                color: #bbb;
			}
			 h3 {
                text-align: center;
                color: #000000;
                font-size: 32px;
            }
        }
        .modelBody {
            padding: 20PX 0;
            border-bottom: 2PX solid #e5e5e5;
           
            p {
                font-size: 28px;
                color: #000333;
                padding: 8px 0;
			}
			.textList{
				text-indent:50px ;
			}
        }
        .modelFooter {
            padding: 10PX 24PX;
            text-align: right;
            button {
                color: #ffffff;
                background-color: #337ab7;
                border-color: #2e6da4;
                padding: 4PX 8PX;
                border-radius: 5PX;
            }
        }
    }
}
</style>

