<template>
    <div class="clear">
        <div class="modelWrap">
			<div class="wrap"></div>
			<div class="box">
				<div class="modelHeader">
					<span @click="close()">x</span>
				</div>
				<div class="modelBody">
					<h3>个人信用报告查询授权书</h3>
					<p>授权人：<span>{{name}}</span></p>
					<p>证件号码：<span>{{idCard}}</span> </p>
					<p>授权书生效日期：<span>{{time}}</span></p>
					<p>一、授权内容</p>
					<p>授权人（亦称“本人”）同意向瀚华金控股份有限公司直接或间接控股的小额贷款公司（统称“瀚华小贷”），包括：重庆市瀚华小额贷款有限责任公司、四川瀚华小额贷款有限公司、南宁市瀚华小额贷款有限公司、天津瀚华小额贷款有限公司、贵阳市南明区瀚华小额贷款有限公司、沈阳金融商贸开发区瀚华科技小额贷款有限公司、深圳瀚华小额贷款有限公司（以下简称“被授权人”）郑重授权如下：</p>
					<p>1.同意被授权人在办理下列业务时，通过查询服务提供机构向金融信用信息基础数据库（包括但不限于中国人民银行个人信用/企业信用信息基础数据库以及经国务院征信业监督管理部门等相关管理部门批准建立的征信机构的信息基础数据库）查询本人信用报告：</p>
					<p>（1）审核本人贷款及其他信贷业务申请的；</p>
					<p>（2）审核本人作为担保人或共同还款人的；</p>
					<p>（3）对已发放的本人信贷进行贷后风险管理的；</p>	
					<p>（4）受理法人、其他组织或自然人（以下合称“信贷申请人”）的信贷申请或对信贷申请人在被授权人处的信贷进行贷后风险管理时，需要查询本人作为信贷申请人的法定代表人、出资人或关联方的信用状况的。</p>
					<p>2.同意通过查询服务提供机构将本人的基本信息和信用信息报送中国人民银行金融信用信息基础数据库。</p>
					<p>3. 本人同意被授权人及被授权人的关联公司和查询服务提供机构通过金融信用信息基础数据库将查询获取的信息进行保存、整理、加工、应用，用于评价本人信用情况或核实本人信息的真实性。</p>
					<p>4. 为更好地为本人提供服务，本人同意并授权查询服务机构可与其合作的第三方进行联合研究，并可将通过本授权书获得的本人信息投入到该等联合研究中。但查询服务机构与其合作的第三方在开展上述联合研究前，应要求其合作的第三方对在联合研究中所获取的本人信息予以保密。</p>
					<p>5.授权期限：</p>
					<p>（1）若属于上述1中的第（1）、（2）、（3）项情形之一的，授权期限为自本授权书生效之日起至本人在被授权人处相应业务结束之日止；</p>
					<p>（2）若属于上述1中的第（4）项情形的，授权期限为自本授权书生效之日起至信贷申请人在被授权人处相应业务结束之日止；</p>
					<p>二、授权书的形式</p>
					<p>授权人同意本授权书以数据电文形式订立；授权人一旦在线确认本授权书，即本授权书即生效。</p>
					<p>三、责任约定</p>
					<p>本人确认对本授权书的条款含义及相应的法律后果已全部通晓并充分理解。被授权人可查询和使用信用报告期间，不应超过本授权书授权期限结束之日。被授权人超出授权查询的一切后果及法律责任由被授权人承担。若本人在被授权人处办理的业务未获批准，本人同意被授权人继续保留此查询授权书和身份证复印件。</p>
					<p>承 诺</p>
					<p>以上授权书确系授权人本人亲自出具，如有不实本公司愿意承担法律责任。</p>
				</div>
				<div class="modelFooter">
					<button @click="close()">确定</button>
				</div>
					
			</div>
		</div>
    </div>
</template>
<script>

export default {
    data(){
        return{
			isShow:false,
			time:""
        }
	},
	props: {
			"name":{
				type:String,		//Array,Boolean,Number
				default:false
			},
			"idCard":{
				type:String,		//Array,Boolean,Number
				default:false
			}
	    },
    methods:{
        close(){
           this.$emit( "isShow",false) ;
        },
        init(){
			let data = new Date();
  			data.setTime(data.getTime());
  			this.time = data.getFullYear()+"-" + (data.getMonth()+1) + "-" + data.getDate();
		},
    },
    created(){
        this.init() ;
    }
}
</script>
<style lang="scss" scoped type="text/css">
   @import "./credit.scss";
</style>

